Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: གང་དེ་ལྟར་སྐྱེ་བ་དང་ལྟ་བ་བྲལ་བ་དེ་ཆོས་ཐམས་ཅད་གཞན་ལ་རག་མ་ལས་པའི་ཡེ་ཤེས་ཀྱི་མཛོད་ཀྱི་ཆོས་དང་ལྡན་པ་གཉིས་མངོན་དུ་མ་བྱུང་ཞིང་བདུད་བཞི་ལས་ཤིན་ཏུ་འདས་པ་དེ་ཆོས་ཐམས་ཅད་སོགས་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “When bodhisattvas are free from birth and views in that way, and possess the Dharma of the treasury of wisdom that all phenomena do not depend on something else, that things do not manifest dualistically, they overcome the four māras, and they no longer perceive the entire collection of phenomena.

source: དེ་ཆོས་ཐམས་ཅད་དང་བྲལ་བས་ཁམས་གསུམ་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་ལས་ཤིན་ཏུ་འདས་པ་ནི་ཡང་སྐྱེ་བ་མེད། འཁོགས་པ་མེད། འཆི་འཕོ་བ་མེད། འབྱུང་བ་ཡང་མེད་དོ། །
en: Since they are free from all phenomena, they have completely transcended the arising of all three realms and there is no arising, no cessation, no death, and no origination.

source: ཞིང་ཐམས་ཅད་སྤྲིན་མགྱོགས་པ་དང་མཉམ་པར་མཐོང་ཞིང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པའི་ཕྱིར་ཉེ་བར་སོང་ངོ་། །
en: They perceive all realms as like quickly moving clouds and they visit them in order to ripen all beings.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་ལས་ཤིན་ཏུ་བཟླ་བའི་ཕྱིར་ཡང་དག་པར་སྤྱོད་པའི་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: Noble son, that is the way that bodhisattvas should cultivate the acceptance of proper conduct in order to completely transcend birth.

source: དེ་ལ་རིགས་ཀྱི་བུ་གང་གཏི་མུག་སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་ལ་རྟོག་པར་འགྱུར།
en: “Noble son, it is delusion to think that old age and death are conditioned by birth.

source: སྐད་ཅིག་མ་དང་ལྡན་པའི་སྐྱེ་བས་རྒལ་བ་ལ་འཚེ་བར་བྱེད། །
en: Momentary birth feeds old age.

source: སྐྱེས་བུ་གཏི་མུག་པ་འདིའི་འདུ་བྱེད་རྣམས་ཕྱི་དང་ནང་གི་སླུ་བ་དང་།
en: Deluded people are deceived by these external and internal formations.

source: གཞན་ཡང་གཉིས་སུ་མེད་པའི་ཚོར་བ་ཇི་སྙེད་པ་རྣམ་པར་ཤེས་པས་རྒ་ཤི་དང་བྲལ་བ་ནས་འཁྲུག་པ་དང་བྲལ་བའི་བར་དུ་རྟོག་པ་མེད།
en: Moreover, since everything from feelings to consciousness is nondual, people are everything from being free from old age and death up to being free from conflict, and are devoid of concepts, devoid of thought, and without deception.

source: རྣམ་པར་རྟོག་པ་མེད་ཅིང་སླུ་བ་མེད་པ་དེ་ལྟར་དེ་བཞིན་དུ་ཚེའི་རླངས་པ་ཡང་རྣམ་པར་ཤེས་པ་ནམ་མཁའ་འདྲ་བར་མཉམ་པ་རྣམ་པར་རྟོག་པ་མེད་པའི་མཉམ་པ་ཉིད་དང་།
en: In the same way, the life breath and consciousness are like space, and thus have the same quality of being without conceptual thought.

source: གཉིས་སུ་མེད་པའི་ལུས་ལ་སླུ་བ་མེད་པས་འཕགས་པ་མ་ཡིན་པའི་བརྫུན་གཉིས་དང་བྲལ་བའོ། །
en: Not being deceived about that fact leads to being free from the two falsehoods of ignoble beings.

source: ཇི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་དབྱིངས་རང་བཞིན་གྱིས་ཉོན་མོངས་པ་མེད་པའི་རྒ་ཤི་འདྲེས་པ་མེད་པ་དེ་བཞིན་དུ་མིག་གི་རྣམ་པར་ཤེས་པ་རྒ་ཤི་སླུ་བའི་འདོད་ཆགས་ལ་ཐུག་པ་ནས་འཁྲུག་པའི་བར་དུའོ། །
en: Just as the realm of all phenomena is by nature devoid of affliction and unadulterated by old age and death, the eye consciousness is also unadulterated by everything from old age and death, deception, and desire, up to distress.

source: དེ་བཞིན་དུ་རྣ་བའི་རྣམ་པར་ཤེས་པ་ཇི་སྙེད་པ་ནས། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྒ་ཤི་སླུ་བ་ནས་འདོད་ཆགས་འཁྲུག་པ་ལ་ཐུག་པའི་བར་དུ་དེ་ལྟར་འདྲེས་པ་མེད་དོ། །
en: Everything from the ear consciousness to the mental consciousness is also unadulterated by everything from old age and death, deception, and desire up to distress.

source: ཡང་མིག་གི་རྣམ་པར་ཤེས་པ་རྒ་ཤི་སླུ་བ་འདོད་ཆགས་མེད་པའི་མཐའ་ནས་འཁྲུག་པའི་བར་དུའོ། །
en: Furthermore, the eye consciousness is also unadulterated by everything from old age and death, deception, and desire, up to distress.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་འདྲེས་པ་མེད་པ་དེ་བཞིན་དུ་རྒ་ཤི་སླུ་བའི་མཐའ་ནས། འཁྲུག་པའི་བར་དུའོ། །
en: Feelings, perceptions, formations, and consciousnesses are also unadulterated, so they are devoid of everything from old age and death and deception, up to distress.

source: ཡང་མིག་རྒ་བ་ནས། འཁྲུག་པའི་བར་དུ་ཡང་དག་པར་འདུས་པ་མེད་དོ། །
en: Furthermore, the eye, from its aging up to its distress, lacks any connection.

source: དེ་ཁོ་ན་ཉིད་ལ་དམིགས་པས་ན་དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་རྒ་ཤི་ནས་འཁྲུག་པའི་བར་དུ་ཡང་དག་པར་འདུས་པ་མེད་དོ། །
en: When observed as it really is, everything related to the ear, the nose, the tongue, the body, and the mind, from old age and death up to distress, lacks any connection.

source: དེ་ཁོ་ན་ཉིད་ལ་དམིགས་པས་ན་གཟུགས་ཀྱི་རྒ་ཤི་ནས་འཁྲུག་པའི་བར་དུ་ཡང་དག་པར་འདུས་པ་མེད་དོ། །
en: When observed as it really is, everything related to forms, from old age and death up to distress, lacks any connection.

source: དེ་ཁོ་ན་ཉིད་ལ་དམིགས་པས་ན་རྣམ་པར་ཤེས་པའི་རྒ་ཤི་འདི་ཇི་སྙེད་པ་ནས། འཁྲུག་པའི་བར་དུ་ཀུན་ཏུ་ཆད་པའི་འདོད་ཆགས་དང་བྲལ་བའི་མཐའ་དད་པ་མེད་དོ། །
en: When observed as it really is, everything related to consciousness, from old age and death up to distress, is no different from the point of being free from attachment that is the state of annihilation.

source: ཚེའི་རླངས་པ་ཡང་རྣམ་པར་ཤེས་པའི་རྒ་ཤི་ནས་འཁྲུགས་པའི་བར་དུ་འདོད་ཆགས་དང་བྲལ་བའི་མཐའ་ཀུན་ཏུ་ཆད་པའོ། །
en: Everything related to the life breath and consciousness, from old age and death up to distress, is annihilated to the point of being free from attachment.

source: རིགས་ཀྱི་བུ་འདི་ལ་ཡང་ཚོར་བའི་ཕུང་པོ་རྣམས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་ཚོར་བའི་ཕུང་པོ་བསྒོམ་པར་བྱའོ། །
en: “Noble son, bodhisattvas should meditate on the aggregate of feeling in the same way as the aggregates related to feeling.

source: གང་ཁམས་གསུམ་ན་དུས་གསུམ་གྱི་ཚོར་བ་མེད་པ་འབྱུང་བ་ཟད་པ་ལ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པའི་བཟོད་པ་འདི་སྒོམ་པར་བྱེད་པ་འདི་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པ་ཉེ་བར་འཚོ་བའི་བཟོད་པ་ལ་བལྟ་བར་བྱའོ། །
en: Cultivating this acceptance of the fact that the feelings associated with the three times do not exist in the three realms and arise and disintegrate, and are impermanent, suffering, and empty, should be regarded as the bodhisattva’s acceptance that ripens and looks after all beings.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་ཡང་ཚུལ་བཞིན་དུ་བརྟག་པའི་ཕྱིར་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: “Furthermore, noble son, bodhisattvas should cultivate this acceptance in order to properly analyze the aggregate of perception.

source: དེ་ལ་འདུ་ཤེས་ཀྱི་ཕུང་པོ་གང་ཞེ་ན།
en: What is the aggregate of perception?

source: འདུ་ཤེས་ཀྱི་ཚོགས་དྲུག་སྟེ། མིག་གི་འདུས་ཏེ་རེག་པ་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་།
en: The six groups of perceptions consist of perceptions generated through eye contact, ear contact, nose contact, tongue contact, body contact, and mind contact.

source: ལུས་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་འདུ་ཤེས་སོ། །དེ་ལ་མིག་གི་འདུས་ཏེ་རེག་པ་ནི་གསུམ་འདུས་པའི་རེག་པ་སྟེ། གང་མིག་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: Eye contact is contact that includes the following three things: the eye, consciousness, and generation of the perception of forms.

source: གཟུགས་ཀྱི་འདུ་ཤེས་འབྱུང་བར་བྱེད་པ་འདི་ནི་གསུམ་འདུས་པ་རེག་པའི་རྐྱེན་གྱིས་འདུ་ཤེས་ཀུན་འབྱུང་བར་འགྱུར་རོ། །
en: All perceptions originate through the condition of contact that includes those three.

source: གང་མིག་གི་གཟུགས་ལ་ཡང་བྱེད་པ་མེད་པ་དང་། རྣམ་པ་མེད་པ་དང་། ལྦུ་བའི་ཕུང་པོ་ལྟ་བུར་དུས་གསུམ་ཐམས་ཅད་ཀྱི་འདུ་བྱེད་སྟོང་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་སྦྱོར་བ་གསུངས་སོ། །
en: It is said that the correct application of the emptiness of formations across the three times to visible forms is that they are not created, are devoid of aspects, and are like a mass of foam.

source: གང་མིག་གི་རྣམ་པར་ཤེས་པ་ནི་ཅི་ལའང་འོང་བ་དང་འགྲོ་བ་སྙེམས་པར་རབ་ཏུ་མི་ཤེས་སོ། །
en: One should not understand the eye consciousness in terms of conceit about it coming and going somewhere.

source: ཁམས་གསུམ་ཐམས་ཅད་ཡུལ་དང་གནས་མེད་པ་མིག་གི་རྣམ་པར་ཤེས་པ་དེས་སྟོང་པ་ནས། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པས་སྟོང་པའི་བར་དུ་ཤེས་པར་བྱའོ། །
en: One should understand that the three realms are without location and groundless and that they are everything from being empty of the eye consciousness up to being empty of the mental consciousness.

source: གང་སྐྱེ་མཆེད་དྲུག་གི་འདུ་ཤེས་འབྱུང་བ་དེ་ཚོར་བའོ། །
en: When perceptions of the six sense fields arise, there is feeling.

source: གང་ཚོར་བ་དེ་རྟོག་པའོ། །
en: When there is feeling, there are concepts.

source: གང་རྟོག་པ་དེ་སྙེམས་པའོ། །
en: When there are concepts, there is conceit.

source: གང་སྙེམས་པ་དེ་ཉེ་བར་ལེན་པའོ། །
en: When there is conceit, there is grasping.

source: གང་ཉེ་བར་ལེན་པ་འབྱུང་བ་ནས། འཁྲུག་པའི་བར་དུ་ཀུན་ནས་ལྡང་སྟེ།
en: When grasping arises, everything up to distress fully arises.

source: དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འདུ་ཤེས་ཚུལ་བཞིན་དུ་བརྟག་པའི་ཕྱིར་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: Therefore, bodhisattvas should cultivate acceptance in order to properly analyze perception.

source: བཟོད་པ་བསྒོམ་པའི་རེག་པ་ཡོངས་སུ་ཤེས་པའི་ཕྱིར་འདུ་ཤེས་ཡོངས་སུ་ཤེས་པ་ཡིན་ནོ། །
en: “Bodhisattvas fully understand perception based on their complete understanding of contact that is related to the cultivation of acceptance.

source: ཡིད་ཀྱི་འདུ་ཤེས་ཀྱི་བར་དུ་བཟོད་པ་དེ་བསྒོམས་པས་འདུ་ཤེས་ཀྱི་ཚོགས་དྲུག་བཟོད་པ་དེ་བསྒོམ་པ་ཡོངས་སུ་ཤེས་པ་ལ་རྟོག་པ་མེད། རྣམ་པར་རྟོག་པ་མེད། ཉེ་བར་མི་འགྲོ། ཉེ་བར་ལེན་པ་མེད། བྱིན་གྱིས་རློབ་པ་མེད།
en: They completely understand cultivating that acceptance of the six groups of perception by cultivating the acceptance of everything up to mental perception, and that understanding has no concepts, no thoughts, and no approaching, grasping, manifestation, or attachment to things as real.

source: མངོན་པར་ཆགས་པའང་མེད་དོ། །འདུ་ཤེས་ཐམས་ཅད་རང་བཞིན་མེད་པ་ཡོངས་སུ་ཆད་པའི་བཟོད་པ་དེ་བསྒོམས་པའི་རྗེས་སུ་འབྱུང་བ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་པ་ཅི་ལ་ཡང་ཆགས་པ་མེད་དོ། ཁམས་གསུམ་ཐམས་ཅད་ཀྱི་དུས་གསུམ་གནས་པ་མེད་པ་དང་། གནས་མེད་པ་དང་།
en: They are not attached at all to the correct understanding that arises after cultivating the acceptance of the fact that all perceptions lack intrinsic nature and are completely annihilated.

source: འཁྲུལ་པ་མེད་པ་དང་། ཞིག་པ་མེད་པ་དང་། བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པ་དང་། གཉིས་སུ་བྱ་བ་མེད་པའི་ཆོས་ཀྱི་དབྱིངས་ལ་ཡང་དག་པར་གཞོལ་བའི་འདུ་ཤེས་ཐམས་ཅད་ཤེས་པ་ནི་ཅིས་ཀྱང་དབྱེ་བ་མེད་དོ། །
en: They understand that all perceptions related to the three realms and the three times are included in the realm of phenomena, which is groundless, baseless, without confusion, without disintegration, without adoption, without rejection, and without dualistic activity, and their understanding is completely indestructible.

source: དེ་འདུ་ཤེས་ཐམས་ཅད་ཉེ་བར་ལེན་པ་མེད་པའི་ཡིད་ཅི་ལའང་དམིགས་པ་མེད་པ་ནི་སོ་སོ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་གྱི་བཟོད་པ་ལ་བསྒོམ་པ་ཞེས་བྱའོ། །
en: When one does not even apprehend the mind that does not grasp at any perceptions, this is referred to as cultivating acceptance related to the method of pure conduct.

source: འདུ་ཤེས་ཐམས་ཅད་ནི་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པའི་བཟོད་པ་སྒོམ་པར་བྱེད་པ་འདི་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པ་ཉེ་བར་འཚོ་བའི་བཟོད་པ་ལ་བལྟ་བར་བྱའོ། །
en: Cultivating acceptance of the fact that all perceptions are impermanent, suffering, and empty should be regarded as the bodhisattvas’ acceptance that ripens and looks after all beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཡང་འདུ་བྱེད་ཡོངས་སུ་ཤེས་པའི་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: “Noble son, bodhisattvas should also cultivate acceptance that completely understands formations.

source: དེ་ལ་འདུ་བྱེད་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are formations?

source: འདུ་བྱེད་རྣམ་པ་གསུམ་མོ། །གསུམ་གང་ཞེ་ན། ལུས་ཀྱི་འདུ་བྱེད་དང་། ངག་གི་འདུ་བྱེད་དང་། ཡིད་ཀྱི་འདུ་བྱེད་དོ། །
en: There are three types of formations: bodily formations, verbal formations, and mental formations.

source: ལུས་ཀྱི་འདུ་བྱེད་ནི་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བའོ། །
en: Bodily formations are the movements of inhalation and exhalation.

source: ངག་གི་འདུ་བྱེད་ནི་རྣམ་པར་རྟོག་པ་དང་།
en: Verbal formations are concepts and discrimination.

source: རྣམ་པར་དཔྱོད་པའོ། །ཡིད་ཀྱི་འདུ་བྱེད་ནི་འདུ་ཤེས་དང་སེམས་པའོ། །
en: Mental formations are perceptions and volition.

source: དེ་ལ་རིགས་ཀྱི་བུ་ལུས་ཀྱི་འདུ་བྱེད་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་ཚུལ་བཞིན་དུ་བརྟག་པར་བྱའོ། །
en: “Noble son, bodhisattvas should properly analyze the physical formations that are the movements of inhalation and exhalation.

source: ལུས་ཐམས་ཅད་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་སམ། །
en: The entire body contains 92,000 or more than ninety-nine quintillion pores.

source: བ་སྤུའི་ཁུང་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ལྷག་ཙམ་གྱི་ལུས་ཐམས་ཅད་ཤིན་ཏུ་ཕྲ་བའི་རྡུལ་དགུ་བཅུ་རྩ་དགུའི་ཁའི་སྒོ་ནས་ཤིན་ཏུ་ཕྲ་བའི་རྡུལ་བརྒྱ་སྟོང་ཕྲག་བཅུ་སོགས་སོ། །
en: Additionally, the entire body has openings the size of the most subtle particles numbering between 99,000 and 110,000.

source: ཉེས་པ་མེད་པའི་མིའི་བ་སྤུའི་ཁུང་བུ་འདི་གཅིག་འགྲངས་བས་ལུས་ཐམས་ཅད་ཀྱི་བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ཀྱི་སྒོ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ཇི་ལྟ་བུར་ཁའི་སྒོ་ནས་དབུགས་རྒྱུ་བ་དེ་ལྟ་བུར་བ་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་དབུགས་རྒྱུའོ་ཞེས་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་ཐམས་ཅད་ཤེས་པར་བྱའོ། །
en: Since satiating a single pore of a flawless person is just like the movement of the breath through the 99,000 openings of all the pores of the entire body, it should be known as the entire movement of inhalation and exhalation called the breath moving through every pore.

source: ཁའི་སྒོ་ཐམས་ཅད་ནས་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བའི་ཕུང་པོ་ལྔ་དག་འབྱུང་བ་དང་ཟད་པ་བརྟག་པའི་ཕྱིར་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: Bodhisattvas should cultivate acceptance in order to analyze the arising and destruction of the five aggregates related to the inhalation and exhalation through every opening.

source: དེ་ལ་ངག་གི་འདུ་བྱེད་གང་ཞེ་ན། གང་རྣམ་པར་རྟོག་པ་དང་།
en: “What are verbal formations?

source: རྣམ་པར་དཔྱོད་པ་སྐད་ཅིག་མར་འབྱུང་ཞིང་འགོག་པ་འདི་ལ་ཡང་སྐད་ཅིག་མ་ཉི་མ་གཅིག་ལ་ཡང་མི་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་ལྔ་སྐད་ཅིག་མར་འོང་བར་འགྱུར་རོ། །
en: Concepts and discriminations arise and cease in a single moment, and for any moment on any given day 6,500,000 people will momentarily arise.

source: དེ་རེ་རེ་ལ་ཡང་རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་སྐད་ཅིག་མ་འབྱུང་བའི་ཕུང་པོ་ལྔ་ཐམས་ཅད་འབྱུང་ངོ་། །འགོག་གོ། །
en: Concepts, discriminations, and all of the five aggregates that arise for a moment, arise and cease for each of them.

source: ཕུང་པོ་དེ་རེ་རེ་ལའང་ཚོར་བ་རྣམ་གསུམ་འབྱུང་ངོ་། །འགོག་གོ། །
en: Three types of feelings arise for each of the aggregates.

source: ཚོར་བ་དེ་རེ་རེ་ལ་ཡང་འབྱུང་བའི་ཡན་ལག་བཅུ་གཉིས་ཐམས་ཅད་འབྱུང་ངོ་། །འགོག་གོ། །
en: Twelve limbs of origination arise for each feeling.

source: འབྱུང་བའི་ཡན་ལག་དེ་རེ་རེ་ལ་ཡང་བག་ལ་ཉལ་བ་དགུ་བཅུ་རྩ་བརྒྱད་འབྱུང་བར་འགྱུར་རོ། །
en: Ninety-eight latent tendencies arise for each of those limbs of origination.

source: བག་ལ་ཉལ་བ་དེ་རེ་རེ་ལ་ཡང་ཁམས་གསུམ་ཐམས་ཅད་ན་སྤྱོད་པ་ཉོན་མོངས་པ་ཀུན་འབྱུང་བ་ལ་བལྟ་བར་བྱའོ། །
en: Since all three realms arise for each of those latent tendencies, bodhisattvas should view conduct as the origin of the afflictions.

source: འདི་དག་ནི་ངག་གི་འདུ་བྱེད་དོ། །
en: These are the verbal formations.

source: དེ་ལ་འདུ་ཤེས་གང་ཞེ་ན།
en: “What are perceptions?

source: དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་ལ་རྣམ་པར་རྟོག་པ་དང་། ཀུན་ཏུ་ཉོན་མོངས་པ་དང་། དེ་ཕྱིན་ཅི་ལོག་ཐམས་ཅད་ཀྱི་མཚན་མས་ཀུན་ཏུ་ཉོན་མོངས་པ་འདི་ཡང་འདུ་ཤེས་སོ། །
en: Perceptions are the concepts, afflictions, and the afflictions caused by the marks associated with all the wrong views that are related to the movement of inhalation and exhalation.

source: དེ་ལ་སེམས་པ་གང་ཞེ་ན། གང་སེམས་པ་དང་།
en: “What is volition?

source: ཚོར་བ་དང་། ཕུང་པོ་དང་། རྣམ་པར་དཔྱོད་པ་དང་། དབང་པོ་དྲུག་དང་། རྣམ་པར་འཕེལ་བ་འདི་ནི་སེ་གོལ་གཏོགས་པ་ཙམ་གྱིས་ཀྱང་འདོད་ཆགས་ཀྱི་ཀུན་གཞི་ཉོན་མོངས་པའི་དབང་པོ་བརྒྱ་ལས་འདས་པ་འབྱུང་བར་འགྱུར།
en: Volitions, feelings, the aggregates, discriminations, the six sense faculties, and augmentations that surpass the one hundred powers of the afflictions that form the ground of attachment manifest in the time it takes to snap the fingers.

source: ཞེ་སྡང་གི་ཀུན་གཞི་བརྒྱ་ལས་འདས་པ་འབྱུང་བར་འགྱུར། གཏི་མུག་གི་ཀུན་གཞི་བརྒྱ་ལས་འདས་པ་འབྱུང་བར་འགྱུར།
en: More than one hundred that are the basis of anger manifest, more than one hundred that are the basis of delusion manifest, and more than one hundred afflictions related to particular types of behavior manifest.

source: ཆ་ཤས་སྤྱོད་པའི་ཉོན་མོངས་པ་བརྒྱ་ལས་འདས་པ་འབྱུང་བར་འགྱུར་བ་འདི་ནི་རིགས་ཀྱི་བུ་ལུས་དང་། ངག་དང་། ཡིད་དོ། །
en: These, noble son, are physical, verbal, and mental volitions.

source: འདུ་བྱེད་དང་། དཔྱོད་པ་དང་། རྣམ་པར་དཔྱོད་པ་དང་། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་འདི་དག་ལ་རྣམ་པར་རྟོག་པས་འདུ་ཤེས་སུ་སེམས་པ་དང་། བསམ་པའི་རྗེས་སུ་སོང་བ་ལ་བྱིན་གྱིས་བརླབས་པ་དེ་ལ།
en: Formations, examination, discrimination, and the movement of inhalation and exhalation are perceived by conceptual thought, and they are the foundation for the passing of thoughts and volitions with respect to perceptions.

source: བྱང་ཆུབ་སེམས་དཔའི་དངོས་པོ་དེ་ལྟར་རང་བཞིན་དང་དུས་གསུམ་ནི་ལུས་དང་། ངག་དང་། ཡིད་དོ། །
en: Thus, the nature of a bodhisattva’s existence and the three times is the body, speech, and mind.

source: འདུ་བྱེད་ལ་དངོས་པོ་མེད་པ་དང་། མི་ཟད་པ་ནི་ཆོས་ཀྱི་དབྱིངས་ལ་ཉོན་མོངས་པ་མེད་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཡོངས་སུ་ཤེས་པ་ནི་རྣམ་པར་དག་པ་རྗེས་སུ་འོང་བ་དེ་ཅིར་དགོས་ཤེ་ན།
en: “Formations are insubstantial and inexhaustible, and the realm of phenomena is devoid of afflictions, so what need is there to arrive at the thorough understanding that the realm of phenomena is utterly pure?

source: ཆོས་ཀྱི་མཚན་ཉིད་རྣམ་པར་དག་པ་དེ་མཚན་ཉིད་མི་རྙེད་པ་དང་། མི་འཛིན་པ་དང་།
en: The fact that the characteristics of phenomena are completely pure means that one does not find characteristics, does not apprehend them, and they do not arise in the realm of phenomena.

source: ཆོས་ཀྱི་དབྱིངས་སུ་མི་འབྱུང་བར་འགྱུར་བ་དེ་ཡང་དག་པའི་མཐའ་མི་སོགས་སོ། །
en: They do not accumulate in ultimate reality.

source: འདུ་བྱེད་ཀྱི་མཐར་མི་རྙེད་པ་དང་། མི་འཛིན་པ་མི་འགོག་པར་འགྱུར་བ་དེ་བཞིན་དུ་འདུ་བྱེད་ཀྱི་མཐའ་དང་།
en: The end of formations is the same in that one does not find or apprehend an end of formations and they do not cease.

source: དེ་ཆོས་ཀྱི་དབྱིངས་སུ་སྙེམས་པ་ཡང་དག་པའི་མཐའ་དང་།
en: This is the ultimate reality of conceit toward the realm of phenomena.

source: དེ་ཆོས་ཐམས་ཅད་ཀྱི་མཐའ་དང་། གང་ཆོས་ཐམས་ཅད་ཀྱི་མཐའ་དང་། དེ་འདུ་བྱེད་གསུམ་དང་། དུས་གསུམ་ཡོངས་སུ་གཅོད་པའི་མཐའ་དང་།
en: It is the end of all phenomena, and what is the end for all phenomena is the end of the elimination of the three types of formation and the three times.

source: དེ་མཐའ་ཡས་པ་མི་གཅོད་པའི་མཐའ་དང་། རྗེས་སུ་མི་གཅོད་པའི་མཐའ་དང་། མི་རྟག་པའི་མཐའ་དང་།
en: This end is the end of the infinite and endless, the end of what does not follow afterward, and the end of impermanence.

source: དེ་ལྟ་བུའི་མཐའ་ནི་དུས་གསུམ་དང་མཉམ་པའི་མཐའ་དང་། མཐར་འགྲོ་བ་དང་། དུས་གསུམ་དང་། ལུས་དང་ངག་དང་། ཡིད་གཉིས་སུ་མེད་པའི་མཐའ་དང་།
en: Such an end is the end of the equality of the three times; it is the end of the nonduality of the three times, of going to the end, and of the body, speech, and mind.

source: དུས་གསུམ་ཐམས་ཅད་ཀྱི་མཐའ་ནི་འདུ་བྱེད་གསུམ་ཡང་དག་པའི་མཐའ་ལ་གཉིས་སུ་མེད་པའི་མཐའ་དང་།
en: The end of all three times is the end of the nonduality in ultimate reality of the three formations.

source: ཅིའང་མ་ཡིན་པའི་མཐའ་དང་།
en: It is the end of nothing whatsoever.

source: རེག་པ་ཡོངས་སུ་ཤེས་པ་གཉིས་སུ་མེད་པའི་མཐའ་དང་།
en: It is the end of the nonduality of the complete understanding of contact.

source: འཇིག་པ་དང་བྲལ་བའི་མཐའ་དང་།
en: It is the end of being free from disintegration.

source: དེ་བཞིན་དུ་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་ཡོངས་སུ་ཤེས་པའི་མཐའ་དང་།
en: In the same way, it is the end of the understanding of the movement of inhalation and exhalation.

source: དེ་བཞིན་དུ་ཉི་ཤུའི་མཐའ་དང་། རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་དང་། ཤིང་ཏ་ལའི་མགོ་བཅད་པའི་མཐའ་དང་།
en: It is likewise the end of the twenty views, the end of concepts and discrimination, which are like a tala tree with the top cut off.

source: འདུ་ཤེས་སུ་མི་ཆགས་པར་སེམས་པ་དང་། སྐད་ཅིག་མའི་མཐའ་སེམས་པའི་མཐའ་དང་།
en: It is the end of volitions that end in a moment and volitions in regard to nonattachment to perceptions.

source: དེ་ལྟར་ཡོངས་སུ་ཤེས་པ་ནི་འདུ་བྱེད་གསུམ་ལ་རྣམ་པར་མི་གཅོད་པའི་མཐར་ཡོངས་སུ་ཤེས་པ་ནི་འདི་ལ་དངོས་པོ་དང་། དངོས་པོ་མ་ཡིན་པར་སྐྱེ་བའོ། །
en: Understanding in this way is an understanding about the end of continuity in regard to the three formations, and it is in regard to this that there is arising with respect to objects and the nonexistence of objects.

source: ཡང་དངོས་པོ་ལས་འདས་པ་ཞེས་བྱ་བ་ནི་འདུ་བྱེད་ཐམས་ཅད་ལ་རྣམ་པར་ཤེས་པ་མེད་པ་དང་། འདུ་བྱེད་ཐམས་ཅད་ལ་གཉིས་དང་། གཉིས་སུ་མེད་པ་ནི་ཡང་དག་པའི་མཐའི་ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པ་དང་། སོགས་པ་དང་། ཉེ་བར་སོགས་པ་དང་བྲལ་བར་འགྱུར་རོ། །
en: Furthermore, what is called transcending objects refers to the fact that all formations lack consciousness, and the fact that in regard to all formations duality and nonduality are free from engagement, accumulation, and increase in the realm of phenomena that is ultimate reality.

source: འདི་ལ་འདུ་བྱེད་ཐམས་ཅད་ལ་བྱིན་གྱིས་མི་རློབ་པའི་མཐའ་དང་། དུས་གསུམ་དུ་ཕྱག་འཚལ་བ་དང་བྲལ་བ་དེ་ཡང་དག་པར་ཡོངས་སུ་ཤེས་པ་དང་།
en: In this respect, perfect understanding is the end of all formations’ lack of foundation, and it is free from reverence for the three times.

source: ཡང་དག་པའི་མཐར་ཡོངས་སུ་ཤེས་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is the complete understanding of ultimate reality known as completely understanding all phenomena.

source: ཡོངས་སུ་བསྐོར་བའི་འདུ་བྱེད་གསུམ་ཡོངས་སུ་ཆད་པའོ། །
en: This eliminates the three types of formations that make one circle in saṃsāra.

source: རིགས་ཀྱི་བུ་གང་དུས་གསུམ་གྱི་འདུ་བྱེད་གསུམ་མི་གཅོད་པའི་མཚན་མ་ལ་དམིགས་པས་བཟོད་པ་སྒོམ་པ་ཡོངས་སུ་འཛིན་ཏོ། །
en: “Noble son, a bodhisattva who apprehends the sign that the three formations related to the three times are not eliminated grasps the cultivation of acceptance.

source: རིགས་ཀྱི་བུ་འདུ་བྱེད་གསུམ་དང་། མཚན་མ་མི་གཅོད་པ་དམིགས་པ་སྤངས་པས་གཉིས་སུ་མེད་པའི་བཟོད་པ་བསྒོམ་མོ། །
en: Noble son, a bodhisattva who has abandoned the apprehension that the sign of the three types of formations is not eliminated cultivates the acceptance of nonduality.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་དུས་གསུམ་དང་། འདུ་བྱེད་གསུམ་པོ་ཡོངས་སུ་ཤེས་པའི་བཟོད་པ་འདི་ནི་སོ་སོ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་གྱིས་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: Therefore, noble son, a bodhisattva should cultivate this acceptance that grasps the three times and the threefold formations as the acceptance by means of the method of perfect conduct for each being.

source: རིགས་ཀྱི་བུ་གང་འདུ་བྱེད་ནི་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པར་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: Noble son, one should cultivate acceptance of the fact that formations are impermanent, suffering, empty, and lack a self.

source: འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཉེ་བར་འཚོ་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པའི་བཟོད་པ་བསྒོམ་པར་བལྟ་བར་བྱའོ། །
en: This should be regarded as the bodhisattvas’ cultivation of the acceptance that ripens and looks after beings.

source: དེ་ལ་རིགས་ཀྱི་བུ་རྣམ་པར་ཤེས་པ་འབྱུང་བའི་ཕུང་པོ་གང་ཞེ་ན།
en: “Noble son, what is the aggregate of the arising of consciousness?

source: རྣམ་པར་ཤེས་པ་དྲུག་གི་ལུས་དང་། མིག་དང་། རེག་པའི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། །
en: This refers to the consciousnesses of contact, such as those of the eye and the body, as they pertain to the six consciousnesses.

source: གང་ཡང་རྣམ་པར་ཤེས་པའི་ལུས་དྲུག་དག་དུས་གསུམ་གྱི་རེག་པས་རྣམ་པར་གནས་པ་དང་། དུས་གསུམ་འབྱུང་བས་རྣམ་པར་ཤེས་པ་དང་། དུས་གསུམ་གྱི་རྣམ་པར་ཤེས་པས་རྣམ་པར་གནས་པ་དེ་ཕན་ཚུན་དུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཀུན་ནས་ལྡང་བར་འགྱུར་རོ། །
en: Furthermore, those six consciousnesses, such as that of the body, give rise to their respective conceptions and conceptualizations of what is established through contact in the three times, the consciousness that is due to arising in the three times, and what is established through consciousness related to the three times.

source: གང་ཡུལ་གྱི་སྲེད་པ་ལ་རྟོག་པ་དང་། དམིགས་པས་བཟོད་པར་སྨྲ་བ་ཡོངས་སུ་འཁྲུག་པའོ། །
en: When one apprehends and thinks about craving related to objects it leads to arguments over the doctrine of acceptance.

source: གང་མིག་དང་གཟུགས་ཀྱི་ཡུལ་ལ་སྲེད་པ་ལ་རྣམ་པར་རྟོག་པས་བཟོད་པ་ཡོངས་སུ་སྤངས་པའོ། །འཁྲུག་པའོ། །
en: Conceptualizing craving for the objects related to the eyes and forms leads to arguing over and completely abandoning acceptance.
